РП/src/Reports/РегламентированныйОтчетОбОбъемахРеализованныхУслуг/РегламентированныйОтчетОбОбъемахРеализованныхУслуг.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Report>
  <name>РегламентированныйОтчетОбОбъемахРеализованныхУслуг</name>
  <comment>Отчет об объемах реализованных услуг</comment>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Периодичность</name>
    <comment>Периодичность представления отчета</comment>
    <type>
      <types>EnumRef.Периодичность</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПодписи</name>
    <comment>Дата подписи</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЕдиницаИзмерения</name>
    <type>
      <types>EnumRef.ПорядкиОкругленияОтчетности</types>
    </type>
  </attributes>
  <attributes>
    <name>ТочностьЕдиницыИзмерения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроцентСтавкиНДСВРознице</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьКодСКП</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КодСКП</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьВидУслуги</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидУслуги</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Report>

РП/src/AccumulationRegisters/ВыручкаИСебестоимостьПродаж/ВыручкаИСебестоимостьПродаж.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ВыручкаИСебестоимостьПродаж</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаВыручки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаВыручкиБезНДС</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Себестоимость</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СебестоимостьБезНДС</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаДополнительныхРасходов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаДополнительныхРасходовБезНДС</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СебестоимостьРегл</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаВыручкиРегл</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПостояннаяРазница</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВременнаяРазница</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаВыручкиСНДСРегл</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаРучнойСкидки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаАвтоматическойСкидки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>НалоговоеНазначение</name>
    <type>
      <types>CatalogRef.НалоговыеНазначенияАктивовИЗатрат</types>
    </type>
  </attributes>
  <attributes>
    <name>ВалютаВзаиморасчетов</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаВВалютеВзаиморасчетов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаБезНДСВВалютеВзаиморасчетов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВалютаДокумента</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаВВалютеДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаБезНДСВВалютеДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИсточникГФУНоменклатуры</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
      <types>CatalogRef.ВидыЗапасов</types>
    </type>
  </attributes>
  <attributes>
    <name>ИсточникГФУРасчетов</name>
    <type>
      <types>DocumentRef.ВозвратТоваровОтКлиента</types>
      <types>DocumentRef.ПоступлениеТоваровУслуг</types>
      <types>DocumentRef.ТаможеннаяДекларацияИмпорт</types>
      <types>DocumentRef.ОтчетКомиссионера</types>
      <types>DocumentRef.ОтчетДавальцу</types>
      <types>DocumentRef.ЗаказПоставщику</types>
      <types>DocumentRef.ВозвратТоваровПоставщику</types>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
      <types>DocumentRef.ОтчетПоКомиссииМеждуОрганизациями</types>
      <types>DocumentRef.ЗаявкаНаВозвратТоваровОтКлиента</types>
      <types>DocumentRef.ОтчетКомитенту</types>
      <types>DocumentRef.РеализацияУслугПрочихАктивов</types>
      <types>DocumentRef.РеализацияТоваровУслуг</types>
      <types>DocumentRef.ОтчетПоКомиссииМеждуОрганизациямиОСписании</types>
      <types>DocumentRef.ПоступлениеУслугПрочихАктивов</types>
      <types>DocumentRef.АктВыполненныхРабот</types>
      <types>DocumentRef.ВозвратТоваровМеждуОрганизациями</types>
      <types>DocumentRef.ПередачаТоваровМеждуОрганизациями</types>
      <types>DocumentRef.ЗаказКлиента</types>
      <types>DocumentRef.ЗаказДавальца</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументДвижения</name>
    <type>
      <types>DocumentRef.ВозвратТоваровОтКлиента</types>
      <types>DocumentRef.ОтчетКомиссионера</types>
      <types>DocumentRef.ОтчетДавальцу</types>
      <types>DocumentRef.КорректировкаРегистров</types>
      <types>DocumentRef.ОтчетПоКомиссииМеждуОрганизациями</types>
      <types>DocumentRef.ОтчетКомитенту</types>
      <types>DocumentRef.КорректировкаРеализации</types>
      <types>DocumentRef.РеализацияТоваровУслуг</types>
      <types>DocumentRef.ОтчетПоКомиссииМеждуОрганизациямиОСписании</types>
      <types>DocumentRef.АктВыполненныхРабот</types>
      <types>DocumentRef.ОтчетОРозничныхПродажах</types>
      <types>DocumentRef.ВозвратТоваровМеждуОрганизациями</types>
      <types>DocumentRef.ПередачаТоваровМеждуОрганизациями</types>
    </type>
  </attributes>
  <attributes>
    <name>РасчетСебестоимости</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>АналитикаУчетаНоменклатуры</name>
    <type>
      <types>CatalogRef.КлючиАналитикиУчетаНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЗаказКлиента</name>
    <type>
      <types>DocumentRef.ОтчетДавальцу</types>
      <types>DocumentRef.ЗаявкаНаВозвратТоваровОтКлиента</types>
      <types>DocumentRef.РеализацияТоваровУслуг</types>
      <types>DocumentRef.АктВыполненныхРабот</types>
      <types>DocumentRef.ЗаказКлиента</types>
      <types>DocumentRef.ЗаказДавальца</types>
    </type>
  </dimensions>
  <dimensions>
    <name>АналитикаУчетаПоПартнерам</name>
    <type>
      <types>CatalogRef.КлючиАналитикиУчетаПоПартнерам</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТипЗапасов</name>
    <type>
      <types>EnumRef.ТипыЗапасов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидЗапасов</name>
    <type>
      <types>CatalogRef.ВидыЗапасов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Менеджер</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Организации</types>
      <types>CatalogRef.СтруктураПредприятия</types>
      <types>CatalogRef.Партнеры</types>
      <types>CatalogRef.Склады</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Соглашение</name>
    <type>
      <types>CatalogRef.СоглашенияСКлиентами</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ХозяйственнаяОперация</name>
    <type>
      <types>EnumRef.ХозяйственныеОперации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>АналитикаУчетаНаборов</name>
    <type>
      <types>CatalogRef.КлючиАналитикиУчетаНаборов</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

РП/src/AccountingRegisters/Хозрасчетный/Хозрасчетный.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccountingRegister>
  <name>Хозрасчетный</name>
  <chartOfAccounts>ChartOfAccounts.Хозрасчетный</chartOfAccounts>
  <correspondence>true</correspondence>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
    <balance>true</balance>
  </dimensions>
  <dimensions>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
    <accountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.Валютный</accountingFlag>
  </dimensions>
  <dimensions>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
    <accountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.УчетПоПодразделениям</accountingFlag>
  </dimensions>
  <dimensions>
    <name>НаправлениеДеятельности</name>
    <type>
      <types>CatalogRef.НаправленияДеятельности</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НалоговоеНазначение</name>
    <type>
      <types>CatalogRef.НалоговыеНазначенияАктивовИЗатрат</types>
    </type>
    <accountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.УчетПоНалоговымНазначениямНДС</accountingFlag>
  </dimensions>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
    <balance>true</balance>
    <extDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Суммовой</extDimensionAccountingFlag>
  </resources>
  <resources>
    <name>ВалютнаяСумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
    <accountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.Валютный</accountingFlag>
    <extDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Валютный</extDimensionAccountingFlag>
  </resources>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
    <accountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.Количественный</accountingFlag>
    <extDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Количественный</extDimensionAccountingFlag>
  </resources>
  <resources>
    <name>СуммаНУ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
    <accountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.НалоговыйУчет</accountingFlag>
    <extDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Суммовой</extDimensionAccountingFlag>
  </resources>
  <resources>
    <name>СуммаПР</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
    <accountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.НалоговыйУчет</accountingFlag>
    <extDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Суммовой</extDimensionAccountingFlag>
  </resources>
  <resources>
    <name>СуммаВР</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
    <accountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.НалоговыйУчет</accountingFlag>
    <extDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Суммовой</extDimensionAccountingFlag>
  </resources>
  <attributes>
    <name>Содержание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НеКорректироватьСтоимостьАвтоматически</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:AccountingRegister>

РП/src/Enums/ТипыЗапасов/ТипыЗапасов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыЗапасов</name>
  <enumValues>
    <name>Товар</name>
  </enumValues>
  <enumValues>
    <name>Материал</name>
  </enumValues>
  <enumValues>
    <name>КомиссионныйТовар</name>
  </enumValues>
  <enumValues>
    <name>Услуга</name>
  </enumValues>
  <enumValues>
    <name>МатериалДавальца</name>
  </enumValues>
  <enumValues>
    <name>ПродукцияДавальца</name>
  </enumValues>
  <enumValues>
    <name>АгентскаяУслуга</name>
  </enumValues>
</mdclass:Enum>

РП/src/Reports/РегламентированныйОтчетОбОбъемахРеализованныхУслуг/Forms/ПомощникЗаполнения/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Организация = Параметры.Организация;
	НачалоПериода = Параметры.НачалоПериода;
	ОкончаниеПериода = Параметры.ОкончаниеПериода;
	
	КлассификаторКВЕД	= ПолучитьСписокКВЕД();   
	Элементы.ТаблицаКВЕД.СписокВыбора.Очистить();
	Для каждого ЭлементСпискаКВЕД Из КлассификаторКВЕД Цикл
		Элементы.ТаблицаКВЕД.СписокВыбора.Добавить(ЭлементСпискаКВЕД.Значение, ЭлементСпискаКВЕД.Значение + " " + ЭлементСпискаКВЕД.Представление);
	КонецЦикла;

 	ИДКонфигурации = РегламентированнаяОтчетностьПереопределяемый.ИДКонфигурации();

	Если ЗначениеЗаполнено(Параметры.СохраненныйДокумент) Тогда
		
		СписокСохранения = Параметры.СохраненныйДокумент.ДанныеОтчета.Получить(); 
		Попытка
			ЗначениеВРеквизитФормы(СписокСохранения.Таблица, "Таблица");
		Исключение
		КонецПопытки;
		ЗначениеВРеквизитФормы(СписокСохранения.T1R, "T1R");            
		Попытка
			ЗначениеВРеквизитФормы(СписокСохранения.ТаблицаКВЕД, "ТаблицаКВЕД");			
		Исключение
		КонецПопытки;
		
	КонецЕсли;
	Элементы.ТаблицаСубконто2.Видимость =  ?(ИДКонфигурации = "ЕРП", Ложь, Истина);
	
КонецПроцедуры

&НаСервере
Функция ПодготовитьДанные(ИдентификаторФормы)
	
	ЗаполнитьИтоговуюТаблицу();
	
	СписокСохранения = Новый Структура;
	СписокСохранения.Вставить("Таблица", РеквизитФормыВЗначение("Таблица"));
	СписокСохранения.Вставить("T1R", РеквизитФормыВЗначение("T1R"));
	СписокСохранения.Вставить("ТаблицаКВЕД", РеквизитФормыВЗначение("ТаблицаКВЕД"));
	
	Возврат ПоместитьВоВременноеХранилище(СписокСохранения, ИдентификаторФормы);

КонецФункции

&НаКлиенте
Процедура ЗаписатьИЗакрыть(Команда)

	Если ПроверитьЗаполнение() Тогда
		
		ВладелецФормы.СохранитьДокументЗаполнения(ПодготовитьДанные(ВладелецФормы.УникальныйИдентификатор));   
		
		Закрыть(Истина);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьИтоговуюТаблицу()

	T1R.Очистить();
	
	ТЗ = T1R.Выгрузить();
	Для каждого ИсходнаяСтрока ИЗ Таблица Цикл
		
		Если НЕ ИсходнаяСтрока.Флаг Тогда
			Продолжить;
		КонецЕсли;
		НомерПериода = Месяц(ИсходнаяСтрока.ДатаДокумента)%3; 
		
		НоваяСтрока = ТЗ.Добавить();
		НоваяСтрока.T1RXXXXG2S = ИсходнаяСтрока.КВЕД;
		НоваяСтрока.T1RXXXXG6S = ИсходнаяСтрока.ВЕД;
		НоваяСтрока.T1RXXXXG3 = 0;
		НоваяСтрока.T1RXXXXG4 = ?(НомерПериода = 1,ИсходнаяСтрока.СуммаДокумента,0);
		НоваяСтрока.T1RXXXXG5 = ?(НомерПериода = 2,ИсходнаяСтрока.СуммаДокумента,0);
		НоваяСтрока.T1RXXXXG7 = ?(НомерПериода = 0,ИсходнаяСтрока.СуммаДокумента,0);
		
	КонецЦикла;
	ТЗ.Свернуть("T1RXXXXНомерСтроки, T1RXXXXG2S, T1RXXXXG6S","T1RXXXXG3, T1RXXXXG4, T1RXXXXG5, T1RXXXXG7");
	ТЗ.Сортировать("T1RXXXXG2S");
	
	НомСтр = 0;
	Для каждого СтрокаТЗ Из ТЗ Цикл
		НомСтр = НомСтр + 1;
		СтрокаТЗ.T1RXXXXНомерСтроки = НомСтр;
		СтрокаТЗ.T1RXXXXG3 = ОкруглитьЧислоПоФормату(СтрокаТЗ.T1RXXXXG4) 
							+ ОкруглитьЧислоПоФормату(СтрокаТЗ.T1RXXXXG5) 
							+ ОкруглитьЧислоПоФормату(СтрокаТЗ.T1RXXXXG7);
	КонецЦикла;
	
	T1R.Загрузить(ТЗ);
	
	//сохраним список КВЕД для подбора в следующем периоде
	ТН = ТаблицаКВЕД.Выгрузить();
	
	ПолнаяТаблица = Таблица.Выгрузить();
	ПолнаяТаблица.Свернуть("Субконто3, Субконто2, Субконто1, КВЕД");
	//выберем строки с заполненным КВЕД
	КоличествоИндексов = ПолнаяТаблица.Количество() - 1;
	Для Индекс = 0 По КоличествоИндексов Цикл
		Строка = ПолнаяТаблица[КоличествоИндексов - Индекс];
		Если НЕ ЗначениеЗаполнено(Строка.КВЕД) Тогда
			ПолнаяТаблица.Удалить(Строка);
		КонецЕсли;
	КонецЦикла;
	
	ТаблицаПоНомеклатуре = ПолнаяТаблица.Скопировать();
	ТаблицаПоНомеклатуре.Свернуть("Субконто3, КВЕД");
	Для каждого ИсходнаяСтрока ИЗ ТаблицаПоНомеклатуре Цикл
		
		Если НЕ ЗначениеЗаполнено(ИсходнаяСтрока.Субконто3) Тогда
			Продолжить;
		КонецЕсли;
		
		СтрокиИсх = ТаблицаПоНомеклатуре.НайтиСтроки(Новый Структура("Субконто3", ИсходнаяСтрока.Субконто3));
		Если СтрокиИсх.Количество() > 1 Тогда 
			//для одной аналитики несколько КВЕД, пропускаем
			Продолжить;
		КонецЕсли;
		
		Строки = ТН.НайтиСтроки(Новый Структура("Аналитика", ИсходнаяСтрока.Субконто3));
		Если Строки.Количество() > 0 Тогда 
			//для уже существующей переписываем КВЕД
		    Строки[0].КВЕД = ИсходнаяСтрока.КВЕД; 
		Иначе
			
			НоваяСтрока = ТН.Добавить();
			НоваяСтрока.Аналитика = ИсходнаяСтрока.Субконто3;
			НоваяСтрока.КВЕД = ИсходнаяСтрока.КВЕД;
		КонецЕсли; 
		
	КонецЦикла;                                 
	
	// удалить строки с заполенной номенклатурой      
	СтрокиБезНоменклатуры = ПолнаяТаблица.НайтиСтроки(Новый Структура("Субконто3", Неопределено));
	ТаблицаПоНоменклатурнымГруппам = ПолнаяТаблица.Скопировать(СтрокиБезНоменклатуры);
	ТаблицаПоНоменклатурнымГруппам.Свернуть("Субконто2, КВЕД");
	Для каждого ИсходнаяСтрока ИЗ ТаблицаПоНоменклатурнымГруппам Цикл
		
		Если НЕ ЗначениеЗаполнено(ИсходнаяСтрока.Субконто2) Тогда
			Продолжить;
		КонецЕсли;
		
		СтрокиИсх = ТаблицаПоНоменклатурнымГруппам.НайтиСтроки(Новый Структура("Субконто2", ИсходнаяСтрока.Субконто2));
		Если СтрокиИсх.Количество() > 1 Тогда 
			//для одной аналитики несколько КВЕД, пропускаем
			Продолжить;
		КонецЕсли;
		
		Строки = ТН.НайтиСтроки(Новый Структура("Аналитика", ИсходнаяСтрока.Субконто2));
		Если Строки.Количество() > 0 Тогда 
			//для уже существующей переписываем КВЕД
		    Строки[0].КВЕД = ИсходнаяСтрока.КВЕД; 
		Иначе
			
			НоваяСтрока = ТН.Добавить();
			НоваяСтрока.Аналитика = ИсходнаяСтрока.Субконто2;
			НоваяСтрока.КВЕД = ИсходнаяСтрока.КВЕД;
		КонецЕсли; 
		
	КонецЦикла;                                 
	
	// берем только строки, с пустыми 
	СтрокиБезНоменклатурыИНоменклатурныхГрупп = ПолнаяТаблица.НайтиСтроки(Новый Структура("Субконто2,Субконто3", Неопределено, Неопределено));
	ТаблицаПоСтатьямДоходов = ПолнаяТаблица.Скопировать(СтрокиБезНоменклатурыИНоменклатурныхГрупп);
	ТаблицаПоСтатьямДоходов.Свернуть("Субконто1, КВЕД");
	Для каждого ИсходнаяСтрока ИЗ ТаблицаПоСтатьямДоходов Цикл
		
		Если НЕ ЗначениеЗаполнено(ИсходнаяСтрока.Субконто1) Тогда
			Продолжить;
		КонецЕсли;
		
		СтрокиИсх = ТаблицаПоСтатьямДоходов.НайтиСтроки(Новый Структура("Субконто1", ИсходнаяСтрока.Субконто1));
		Если СтрокиИсх.Количество() > 1 Тогда 
			//для одной аналитики несколько КВЕД, пропускаем
			Продолжить;
		КонецЕсли;
		
		Строки = ТН.НайтиСтроки(Новый Структура("Аналитика", ИсходнаяСтрока.Субконто1));
		Если Строки.Количество() > 0 Тогда 
			//для уже существующей переписываем КВЕД
		    Строки[0].КВЕД = ИсходнаяСтрока.КВЕД; 
		Иначе
			
			НоваяСтрока = ТН.Добавить();
			НоваяСтрока.Аналитика = ИсходнаяСтрока.Субконто1;
			НоваяСтрока.КВЕД = ИсходнаяСтрока.КВЕД;
		КонецЕсли; 
		
	КонецЦикла;                                 
	
	ТаблицаКВЕД.Загрузить(ТН);
	
КонецПроцедуры

// ОкруглитьЧислоПоФормату(Форма, )
//
&НаКлиентеНаСервереБезКонтекста
Функция ОкруглитьЧислоПоФормату(ИсходноеЧисло)
		
	Возврат Окр(ИсходноеЧисло / 1000, 1) * 1000;
	
КонецФункции // ОкруглитьЧислоПоФормату(Форма, )

&НаСервере
Процедура АвтоподборНаСервере() 
	
	Таблица.Очистить();

 	ИДКонфигурации = РегламентированнаяОтчетностьПереопределяемый.ИДКонфигурации(); 
	ИДКонф = РегламентированнаяОтчетностьПереопределяемый.ИДКонфигурации(Истина);
	
	Если ИДКонфигурации = "ЕРП" Тогда 
		ЗапросВыручка = Новый Запрос;
		ЗапросВыручка.УстановитьПараметр("НачалоПериода", НачалоПериода);
		ЗапросВыручка.УстановитьПараметр("ОкончаниеПериода", ОкончаниеПериода);
		ЗапросВыручка.УстановитьПараметр("Организация", Организация);
		ЗапросВыручка.УстановитьПараметр("ТипЗапасовУслуга", Перечисления.ТипыЗапасов.Услуга); 
		
		Если ФлагНЕОтображатьДокумент Тогда

			ТекстЗапросаВыручка = 
			"ВЫБРАТЬ
			|	ВыручкаИСебестоимостьПродажОбороты.АналитикаУчетаНоменклатуры.Номенклатура КАК Номенклатура,
			|	СУММА(ВыручкаИСебестоимостьПродажОбороты.СуммаВыручкиРеглОборот) КАК Сумма,
			|	НАЧАЛОПЕРИОДА(ВыручкаИСебестоимостьПродажОбороты.Период, МЕСЯЦ) КАК Период
			|ИЗ
			|	РегистрНакопления.ВыручкаИСебестоимостьПродаж.Обороты(&НачалоПериода, &ОкончаниеПериода, Регистратор, ) КАК ВыручкаИСебестоимостьПродажОбороты
			|ГДЕ
			|	ВыручкаИСебестоимостьПродажОбороты.ТипЗапасов = &ТипЗапасовУслуга
			|	И ВыручкаИСебестоимостьПродажОбороты.Регистратор.Организация = &Организация
			|
			|СГРУППИРОВАТЬ ПО
			|	ВыручкаИСебестоимостьПродажОбороты.АналитикаУчетаНоменклатуры.Номенклатура,
			|	НАЧАЛОПЕРИОДА(ВыручкаИСебестоимостьПродажОбороты.Период, МЕСЯЦ)";
		
		
		Иначе	
			
			ТекстЗапросаВыручка = 
			"ВЫБРАТЬ
			|	ВыручкаИСебестоимостьПродажОбороты.Регистратор КАК Регистратор,
			|	ВыручкаИСебестоимостьПродажОбороты.Период КАК Период,
			|	ВыручкаИСебестоимостьПродажОбороты.АналитикаУчетаНоменклатуры.Номенклатура КАК Номенклатура,
			|	СУММА(ВыручкаИСебестоимостьПродажОбороты.СуммаВыручкиРеглОборот) КАК Сумма
			|ИЗ
			|	РегистрНакопления.ВыручкаИСебестоимостьПродаж.Обороты(&НачалоПериода, &ОкончаниеПериода, Регистратор, ) КАК ВыручкаИСебестоимостьПродажОбороты
			|ГДЕ
			|	ВыручкаИСебестоимостьПродажОбороты.ТипЗапасов = &ТипЗапасовУслуга
			|	И ВыручкаИСебестоимостьПродажОбороты.Регистратор.Организация = &Организация
			|
			|СГРУППИРОВАТЬ ПО
			|	ВыручкаИСебестоимостьПродажОбороты.Регистратор,
			|	ВыручкаИСебестоимостьПродажОбороты.Период,
			|	ВыручкаИСебестоимостьПродажОбороты.АналитикаУчетаНоменклатуры.Номенклатура";
			
		КонецЕсли;
		
		ЗапросВыручка.Текст = ТекстЗапросаВыручка;
		
		РезультатЗапроса = ЗапросВыручка.Выполнить();
		ВыборкаВыручка = РезультатЗапроса.Выбрать(); 
		
		Пока ВыборкаВыручка.Следующий() Цикл  
			
			НоваяСтрока = Таблица.Добавить();
			Если НЕ ФлагНЕОтображатьДокумент Тогда
				НоваяСтрока.Документ = ВыборкаВыручка.Регистратор;
			КонецЕсли;
			НоваяСтрока.Субконто3 = ВыборкаВыручка.Номенклатура;
			НоваяСтрока.ДатаДокумента = ВыборкаВыручка.Период;
			ЗаполнитьКВЕДВСтрокеАналитика(НоваяСтрока);
			НоваяСтрока.Флаг= КВЕДВключаетсяВОтчет(НоваяСтрока.КВЕД);
			НоваяСтрока.ВЕД = ПолучитьНаименованиеВЕД(НоваяСтрока.КВЕД);
			НоваяСтрока.СуммаДокумента = ВыборкаВыручка.Сумма;
			
		КонецЦикла;
		
	    //оставшиеся документы
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("НачалоПериода", НачалоПериода);
		Запрос.УстановитьПараметр("ОкончаниеПериода", ОкончаниеПериода);
		Запрос.УстановитьПараметр("Организация", Организация);
		
		ТекстЗапроса = 
		"ВЫБРАТЬ
			|	Услуги.Период КАК Период,
			|	Услуги.Регистратор КАК Регистратор,
			|	Услуги.СчетКт КАК Счет,
			|	Услуги.СубконтоКт1 КАК СубконтоКт1,
			|	Услуги.СубконтоКт2 КАК СубконтоКт2,
			|	Услуги.СуммаОборот КАК Сумма,
			|	ЕСТЬNULL(НДС.СуммаОборот, 0) КАК СуммаНДС
			|ИЗ
			|	РегистрБухгалтерии.Хозрасчетный.ОборотыДтКт(&НачалоПериода, &ОкончаниеПериода, Регистратор, , , СчетКт В ИЕРАРХИИ (&СписокСчетов), , Организация = &Организация) КАК Услуги
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрБухгалтерии.Хозрасчетный.ОборотыДтКт(&НачалоПериода, &ОкончаниеПериода, Регистратор, СчетДт В ИЕРАРХИИ (&СписокСчетов), , СчетКт В ИЕРАРХИИ (&СписокСчетовНДС), , Организация = &Организация) КАК НДС
			|		ПО Услуги.Регистратор = НДС.Регистратор
			|			И Услуги.СчетКт = НДС.СчетДт";
		
		ПС = ПланыСчетов["Хозрасчетный"];
		
		СписокСчетов = Новый Массив();
		СписокСчетов.Добавить(ПС.ДоходОтРеализацииРаботИУслуг);	//703  
		СписокСчетов.Добавить(ПС.ДоходОтОперационнойАрендыАктивов);     //713
		СписокСчетов.Добавить(ПС.ДругиеДоходы);     //74
		Запрос.УстановитьПараметр ("СписокСчетов",СписокСчетов);

		СписокСчетовНДС = Новый Массив();
		СписокСчетовНДС.Добавить(ПС.РасчетыПоНалогамИПлатежам); //64
		Запрос.УстановитьПараметр ("СписокСчетовНДС",СписокСчетовНДС);

		Запрос.Текст = ТекстЗапроса;
		
		РезультатЗапроса = Запрос.Выполнить();
		Выборка = РезультатЗапроса.Выбрать();
		Пока Выборка.Следующий() Цикл  
			
				ОбработкаСтрокиЕРП(Выборка.Регистратор, Выборка.Счет, Выборка.Сумма-Выборка.СуммаНДС, Выборка.СубконтоКт1, Выборка.СубконтоКт2, ИДКонф);
		КонецЦикла; 
	
	Иначе

		ЗаполнитьПоБУ();

	КонецЕсли; 
		
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаСтрокиЕРП(ДокументРегистратор, Счет, ДокументСумма, Субконто1, Субконто2, ИДКонф)
	
		ТипДокумента = ТипЗнч(ДокументРегистратор); 
		
		Если ТипДокумента = Тип("ДокументСсылка.РеализацияТоваровУслуг")  
			ИЛИ ТипДокумента = Тип("ДокументСсылка.АктВыполненныхРабот")  
			ИЛИ ТипДокумента = Тип("ДокументСсылка.ОтчетКомитенту") 
			ИЛИ ТипДокумента = Тип("ДокументСсылка.ОтчетОРозничныхПродажах")  
			ИЛИ ТипДокумента = Тип("ДокументСсылка.ОтчетДавальцу")  
			ИЛИ ТипДокумента = Тип("ДокументСсылка.ПередачаТоваровМеждуОрганизациями") Тогда
			// уже учтены
			
			
		ИначеЕсли ТипДокумента = Тип("ДокументСсылка.ОтчетКомиссионераОСписании") 
			Или (ИДКонф = "ERP25" И ТипДокумента = Тип("ДокументСсылка.ВыкупТоваровХранителем"))  
			Или ТипДокумента = Тип("ДокументСсылка.ОтчетКомиссионера")  
			Или ТипДокумента = Тип("ДокументСсылка.РегламентнаяОперация") Тогда 
				//пропускаем 
				
		Иначе  //операция, РеализацияУслугПрочихАктивов
			НоваяСтрока = Таблица.Добавить();
			НоваяСтрока.Документ = ДокументРегистратор;
			НоваяСтрока.Счет = Счет;
			НоваяСтрока.Субконто1 = Субконто1;
			НоваяСтрока.Субконто2 = Субконто2;
			НоваяСтрока.ДатаДокумента = ДокументРегистратор.Дата;
			ЗаполнитьКВЕДВСтрокеАналитика(НоваяСтрока);
			НоваяСтрока.Флаг= КВЕДВключаетсяВОтчет(НоваяСтрока.КВЕД);
			НоваяСтрока.ВЕД = ПолучитьНаименованиеВЕД(НоваяСтрока.КВЕД);
			НоваяСтрока.СуммаДокумента = ДокументСумма;
			
		КонецЕсли;
	
КонецПроцедуры

&НаСервере
//Процедура ОбработкаСтрокиБУ(ДокументРегистратор, Счет, ДокументСумма)
Процедура ЗаполнитьПоБУ()
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("НачалоПериода", НачалоПериода);
	Запрос.УстановитьПараметр("ОкончаниеПериода", ОкончаниеПериода);
	Запрос.УстановитьПараметр("Организация", Организация);
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
		|	ХозрасчетныйВидыСубконто.Ссылка КАК Счет,
		|	КОЛИЧЕСТВО(ХозрасчетныйВидыСубконто.ВидСубконто) КАК КоличествоСубконто
		|ПОМЕСТИТЬ ВтСчетаСКоличеством
		|ИЗ
		|	ПланСчетов.Хозрасчетный.ВидыСубконто КАК ХозрасчетныйВидыСубконто
		|ГДЕ
		|	ХозрасчетныйВидыСубконто.Ссылка В ИЕРАРХИИ (&СписокСчетов)
		|
		|СГРУППИРОВАТЬ ПО
		|	ХозрасчетныйВидыСубконто.Ссылка
		|;
	    | 
		|////////////////////////////////////////////////////////////////////////////////
		|
		|ВЫБРАТЬ
		|	Услуги.Период КАК Период,
		|	Услуги.Регистратор КАК Регистратор,
		|	Услуги.СуммаОборот КАК Сумма,
		|	Услуги.СчетКт КАК Счет,
		|	Услуги.СубконтоКт1 КАК СубконтоКт1,
		|	Услуги.СубконтоКт2 КАК СубконтоКт2,
		|	Услуги.СубконтоКт3 КАК СубконтоКт3,
		|	ЕСТЬNULL(НДС.СуммаОборот, 0) КАК СуммаНДС
		|ИЗ
		|	РегистрБухгалтерии.Хозрасчетный.ОборотыДтКт(&НачалоПериода, &ОкончаниеПериода, Регистратор, , , 
		|				СчетКт В (ВЫБРАТЬ
		|						ВтСчетаСКоличеством.Счет КАК Счет
		|							ИЗ
		|						ВтСчетаСКоличеством КАК ВтСчетаСКоличеством
		|				ГДЕ
		|						ВтСчетаСКоличеством.КоличествоСубконто = 3), &СписокСубконто3 , Организация = &Организация) КАК Услуги
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрБухгалтерии.Хозрасчетный.ОборотыДтКт(&НачалоПериода, &ОкончаниеПериода, Регистратор, 
		|				СчетДт В (ВЫБРАТЬ
		|						ВтСчетаСКоличеством.Счет КАК Счет
		|							ИЗ
		|						ВтСчетаСКоличеством КАК ВтСчетаСКоличеством
		|				ГДЕ
		|						ВтСчетаСКоличеством.КоличествоСубконто = 3),&СписокСубконто3 , СчетКт В ИЕРАРХИИ (&СписокСчетовНДС), , Организация = &Организация) КАК НДС
		|		ПО Услуги.Регистратор = НДС.Регистратор
		|			И Услуги.СчетКт = НДС.СчетДт
		|			И Услуги.СубконтоКт1 = НДС.СубконтоДт1
		|			И Услуги.СубконтоКт2 = НДС.СубконтоДт2
		|			И Услуги.СубконтоКт3 = НДС.СубконтоДт3   
		|
		| ОБЪЕДИНИТЬ ВСЕ
		|
		| ВЫБРАТЬ
		|	Услуги.Период КАК Период,
		|	Услуги.Регистратор КАК Регистратор,
		|	Услуги.СуммаОборот КАК Сумма,
		|	Услуги.СчетКт КАК Счет,
		|	Услуги.СубконтоКт1 КАК СубконтоКт1,
		|	Услуги.СубконтоКт2 КАК СубконтоКт2,
		|	НЕОПРЕДЕЛЕНО КАК СубконтоКт3,
		|	ЕСТЬNULL(НДС.СуммаОборот, 0) КАК СуммаНДС
		|ИЗ
		|	РегистрБухгалтерии.Хозрасчетный.ОборотыДтКт(&НачалоПериода, &ОкончаниеПериода, Регистратор, , , 
		|				СчетКт В (ВЫБРАТЬ
		|						ВтСчетаСКоличеством.Счет КАК Счет
		|							ИЗ
		|						ВтСчетаСКоличеством КАК ВтСчетаСКоличеством
		|				ГДЕ
		|						ВтСчетаСКоличеством.КоличествоСубконто = 2), &СписокСубконто2 , Организация = &Организация) КАК Услуги
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрБухгалтерии.Хозрасчетный.ОборотыДтКт(&НачалоПериода, &ОкончаниеПериода, Регистратор, 
		|				СчетДт В (ВЫБРАТЬ
		|						ВтСчетаСКоличеством.Счет КАК Счет
		|							ИЗ
		|						ВтСчетаСКоличеством КАК ВтСчетаСКоличеством
		|				ГДЕ
		|						ВтСчетаСКоличеством.КоличествоСубконто = 2) ,&СписокСубконто2 , СчетКт В ИЕРАРХИИ (&СписокСчетовНДС), , Организация = &Организация) КАК НДС
		|		ПО Услуги.Регистратор = НДС.Регистратор
		|			И Услуги.СчетКт = НДС.СчетДт
		|			И Услуги.СубконтоКт1 = НДС.СубконтоДт1
		|			И Услуги.СубконтоКт2 = НДС.СубконтоДт2
		|
		| ОБЪЕДИНИТЬ ВСЕ
		|
		| ВЫБРАТЬ
		|	Услуги.Период КАК Период,
		|	Услуги.Регистратор КАК Регистратор,
		|	Услуги.СуммаОборот КАК Сумма,
		|	Услуги.СчетКт КАК Счет,
		|	Услуги.СубконтоКт1 КАК СубконтоКт1,
		|	НЕОПРЕДЕЛЕНО КАК СубконтоКт2,
		|	НЕОПРЕДЕЛЕНО КАК СубконтоКт3,
		|	ЕСТЬNULL(НДС.СуммаОборот, 0) КАК СуммаНДС
		|ИЗ
		|	РегистрБухгалтерии.Хозрасчетный.ОборотыДтКт(&НачалоПериода, &ОкончаниеПериода, Регистратор, , , 
		|				СчетКт В (ВЫБРАТЬ
		|						ВтСчетаСКоличеством.Счет КАК Счет
		|							ИЗ
		|						ВтСчетаСКоличеством КАК ВтСчетаСКоличеством
		|				ГДЕ
		|						ВтСчетаСКоличеством.КоличествоСубконто = 1), &СписокСубконто1 , Организация = &Организация) КАК Услуги
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрБухгалтерии.Хозрасчетный.ОборотыДтКт(&НачалоПериода, &ОкончаниеПериода, Регистратор, 
		|				СчетДт В (ВЫБРАТЬ
		|						ВтСчетаСКоличеством.Счет КАК Счет
		|							ИЗ
		|						ВтСчетаСКоличеством КАК ВтСчетаСКоличеством
		|				ГДЕ
		|						ВтСчетаСКоличеством.КоличествоСубконто = 1),&СписокСубконто1 , СчетКт В ИЕРАРХИИ (&СписокСчетовНДС), , Организация = &Организация) КАК НДС
		|		ПО Услуги.Регистратор = НДС.Регистратор
		|			И Услуги.СчетКт = НДС.СчетДт
		|			И Услуги.СубконтоКт1 = НДС.СубконтоДт1
		|
		| УПОРЯДОЧИТЬ ПО 
		|	Период
		|
		|";
	
	
	ПС = ПланыСчетов["Хозрасчетный"];
	
	СписокСчетов = Новый Массив();
	СписокСчетов.Добавить(ПС.ДоходОтРеализацииРаботИУслуг);	//703  
	СписокСчетов.Добавить(ПС.ДоходОтОперационнойАрендыАктивов);     //713
	СписокСчетов.Добавить(ПС.ДругиеДоходы);     //74
	Запрос.УстановитьПараметр ("СписокСчетов",СписокСчетов);

	СписокСчетовНДС = Новый Массив();
	СписокСчетовНДС.Добавить(ПС.РасчетыПоНалогамИПлатежам); //64
	Запрос.УстановитьПараметр ("СписокСчетовНДС",СписокСчетовНДС);
	
	ВидыСубконто = ПланыВидовХарактеристик["ВидыСубконтоХозрасчетные"];

	СписокСубконто1 = Новый Массив();
	СписокСубконто1.Добавить(ВидыСубконто.СтатьиДоходов);	
	Запрос.УстановитьПараметр ("СписокСубконто1",СписокСубконто1);

	СписокСубконто2 = Новый Массив();
	СписокСубконто2.Добавить(ВидыСубконто.СтатьиДоходов);	
	СписокСубконто2.Добавить(ВидыСубконто.НоменклатурныеГруппы);  
	Запрос.УстановитьПараметр ("СписокСубконто2",СписокСубконто2);
	
	СписокСубконто3 = Новый Массив();
	СписокСубконто3.Добавить(ВидыСубконто.СтатьиДоходов);	
	СписокСубконто3.Добавить(ВидыСубконто.НоменклатурныеГруппы);  
	СписокСубконто3.Добавить(ВидыСубконто.Номенклатура);
	Запрос.УстановитьПараметр ("СписокСубконто3",СписокСубконто3);
	
	Запрос.Текст = ТекстЗапроса;
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		НоваяСтрока = Таблица.Добавить();
		Если НЕ ФлагНЕОтображатьДокумент Тогда
			НоваяСтрока.Документ=Выборка.Регистратор;
		КонецЕсли;
		НоваяСтрока.Счет=Выборка.Счет;
		НоваяСтрока.Субконто1=Выборка.СубконтоКт1;
		НоваяСтрока.Субконто2=Выборка.СубконтоКт2;
		НоваяСтрока.Субконто3=Выборка.СубконтоКт3;
		ЗаполнитьКВЕДВСтрокеАналитика(НоваяСтрока);
		НоваяСтрока.Флаг= КВЕДВключаетсяВОтчет(НоваяСтрока.КВЕД);
		НоваяСтрока.ВЕД = ПолучитьНаименованиеВЕД(НоваяСтрока.КВЕД);
		
		Если НЕ ФлагНЕОтображатьДокумент Тогда
			НоваяСтрока.ДатаДокумента=Выборка.Регистратор.Дата; 
		Иначе
			НоваяСтрока.ДатаДокумента=НачалоМесяца(Выборка.Регистратор.Дата); 
		КонецЕсли;
		НоваяСтрока.СуммаДокумента=Выборка.Сумма-Выборка.СуммаНДС;    
	КонецЦикла; 
	Если ФлагНЕОтображатьДокумент Тогда
		ПолнаяТаблица = Таблица.Выгрузить();
		ПолнаяТаблица.Свернуть("Флаг, ДатаДокумента, Счет, Субконто3, Субконто2, Субконто1, КВЕД, ВЕД, Документ","СуммаДокумента");
		Таблица.Загрузить(ПолнаяТаблица);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Автоподбор(Команда)
	
	АвтоподборНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьДанныеПредыдущегоПериода(Команда)
	
	АдресДанных = ВладелецФормы.ЗаполнитьТаблицуКВЕДИзОтчетаПрошлогоПериода();
	
	ЗаполнитьДанныеПредыдущегоПериодаНаСервере(АдресДанных);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДанныеПредыдущегоПериодаНаСервере(АдресДанных)
	
	Если АдресДанных = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТЗ = ПолучитьИзВременногоХранилища(АдресДанных);
	Если ТЗ = Неопределено Тогда
		Возврат;
	КонецЕсли;  
	
	ТаблицаКВЕД.Очистить();
	Для каждого СтрокаТЗ Из ТЗ Цикл
		
		НоваяСтрока = ТаблицаКВЕД.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТЗ);
		
	КонецЦикла;

	Для каждого ИсходнаяСтрока Из Таблица Цикл
		ЗаполнитьКВЕДВСтрокеАналитика(ИсходнаяСтрока);
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция ВыделитьКВЕД(Знач КодУКТВЭД) 
	Перем КВЕД;
	
	КВЕД = СокрЛП(Лев(КодУКТВЭД, 5));
	Если Сред(КВЕД,5,1) = "0" Тогда  		
		Возврат Лев(КВЕД, 4);
	Иначе
		Возврат КВЕД;
	КонецЕсли;
		
КонецФункции

&НаСервере
Функция ЗаполнитьКВЕДВСтрокеАналитика(ИсходнаяСтрока)
	
	НоменклатураЕсть = Ложь;
	Номенклатура = Неопределено;
	Если ТипЗнч(ИсходнаяСтрока.Субконто3) = Тип("СправочникСсылка.Номенклатура") и
		ЗначениеЗаполнено(ИсходнаяСтрока.Субконто3) Тогда
		
		КодДляПН = ИсходнаяСтрока.Субконто3.НоменклатураГТД;           
		Если ЗначениеЗаполнено(КодДляПН) Тогда
			Если ТипЗнч(КодДляПН) = Тип("СправочникСсылка.КлассификаторУКТВЭД") Тогда
				КодУКТВЭД = КодДляПН;
			ИначеЕсли  ТипЗнч(КодДляПН) = Тип("СправочникСсылка.НоменклатураГТД") Тогда
				КодУКТВЭД = КодДляПН.КодУКТВЭД;		
			КонецЕсли;
			ИсходнаяСтрока.КВЕД = ВыделитьКВЕД(КодУКТВЭД); 	
		КонецЕсли;

	КонецЕсли;		
	
	Если ПустаяСтрока(ИсходнаяСтрока.КВЕД) И ЗначениеЗаполнено(ИсходнаяСтрока.Субконто3) Тогда
		Строки = ТаблицаКВЕД.НайтиСтроки(Новый Структура("Аналитика", ИсходнаяСтрока.Субконто3));
		Если Строки.Количество() > 0 Тогда 
			ИсходнаяСтрока.КВЕД = Строки[0].КВЕД;
		КонецЕсли; 
	КонецЕсли;
	
	Если ПустаяСтрока(ИсходнаяСтрока.КВЕД) И ЗначениеЗаполнено(ИсходнаяСтрока.Субконто2) И НЕ ЗначениеЗаполнено(ИсходнаяСтрока.Субконто3) Тогда
		Строки = ТаблицаКВЕД.НайтиСтроки(Новый Структура("Аналитика", ИсходнаяСтрока.Субконто2));
		Если Строки.Количество() > 0 Тогда 
			ИсходнаяСтрока.КВЕД = Строки[0].КВЕД;
		КонецЕсли; 
	КонецЕсли;
	
	Если ПустаяСтрока(ИсходнаяСтрока.КВЕД) И ЗначениеЗаполнено(ИсходнаяСтрока.Субконто1) И НЕ ЗначениеЗаполнено(ИсходнаяСтрока.Субконто2) И НЕ ЗначениеЗаполнено(ИсходнаяСтрока.Субконто3) Тогда
		Строки = ТаблицаКВЕД.НайтиСтроки(Новый Структура("Аналитика", ИсходнаяСтрока.Субконто1));
		Если Строки.Количество() > 0 Тогда 
			ИсходнаяСтрока.КВЕД = Строки[0].КВЕД;
		КонецЕсли; 
	КонецЕсли;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция КВЕДВключаетсяВОтчет(КВЕД)
	
	ГруппаКВЕД = Лев(КВЕД,2);
	Если ГруппаКВЕД >= "49" и ГруппаКВЕД <= "63" Тогда
		Возврат Истина;
	ИначеЕсли ГруппаКВЕД >= "68" и ГруппаКВЕД <= "82" Тогда
		Возврат Истина;
	Иначе 
		Возврат Ложь;
	КонецЕсли;	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьСписокКВЕД()
	   
	СписокКВЕД = Новый СписокЗначений; 
	СписокКВЕД.Добавить("49.1","Пасажирський залізничний транспорт міжміського сполучення"); 
	СписокКВЕД.Добавить("49.2","Вантажний залізничний транспорт"); 
	СписокКВЕД.Добавить("49.31","Пасажирський наземний транспорт міського та приміського сполучення"); 
	СписокКВЕД.Добавить("49.32","Надання послуг таксі"); 
	СписокКВЕД.Добавить("49.39","Інший пасажирський наземний транспорт, н.в.і.у."); 
	СписокКВЕД.Добавить("49.41","Вантажний автомобільний транспорт"); 
	СписокКВЕД.Добавить("49.42","Надання послуг перевезення речей (переїзду)"); 
	СписокКВЕД.Добавить("49.5","Трубопровідний транспорт"); 
	СписокКВЕД.Добавить("50.1","Пасажирський морський транспорт"); 
	СписокКВЕД.Добавить("50.2","Вантажний морський транспорт"); 
	СписокКВЕД.Добавить("50.3","Пасажирський річковий транспорт"); 
	СписокКВЕД.Добавить("50.4","Вантажний річковий транспорт"); 
	СписокКВЕД.Добавить("51.1","Пасажирський авіаційний транспорт"); 
	СписокКВЕД.Добавить("51.21","Вантажний авіаційний транспорт"); 
	СписокКВЕД.Добавить("51.22","Космічний транспорт"); 
	СписокКВЕД.Добавить("52.1","Складське господарство"); 
	СписокКВЕД.Добавить("52.21","Допоміжне обслуговування наземного транспорту"); 
	СписокКВЕД.Добавить("52.22","Допоміжне обслуговування водного транспорту"); 
	СписокКВЕД.Добавить("52.23","Допоміжне обслуговування авіаційного транспорту"); 
	СписокКВЕД.Добавить("52.24","Транспортне оброблення вантажів"); 
	СписокКВЕД.Добавить("52.29","Інша допоміжна діяльність у сфері транспорту"); 
	СписокКВЕД.Добавить("53.1","Діяльність національної пошти"); 
	СписокКВЕД.Добавить("53.2","Інша поштова та кур'єрська діяльність"); 
	СписокКВЕД.Добавить("55.1","Діяльність готелів і подібних засобів тимчасового розміщування"); 
	СписокКВЕД.Добавить("55.2","Діяльність засобів розміщування на період відпустки та іншого тимчасового проживання"); 
	СписокКВЕД.Добавить("55.3","Надання місць кемпінгами та стоянками для житлових автофургонів і причепів"); 
	СписокКВЕД.Добавить("55.9","Діяльність інших засобів тимчасового розміщування"); 
	СписокКВЕД.Добавить("56.1","Діяльність ресторанів, надання послуг мобільного харчування"); 
	СписокКВЕД.Добавить("56.21","Постачання готових страв для подій"); 
	СписокКВЕД.Добавить("56.29","Постачання інших готових страв"); 
	СписокКВЕД.Добавить("56.3","Обслуговування напоями"); 
	СписокКВЕД.Добавить("58.11","Видання книг"); 
	СписокКВЕД.Добавить("58.12","Видання довідників і каталогів"); 
	СписокКВЕД.Добавить("58.13","Видання газет"); 
	СписокКВЕД.Добавить("58.14","Видання журналів і періодичних видань"); 
	СписокКВЕД.Добавить("58.19","Інші види видавничої діяльності"); 
	СписокКВЕД.Добавить("58.21","Видання комп'ютерних ігор"); 
	СписокКВЕД.Добавить("58.29","Видання іншого програмного забезпечення"); 
	СписокКВЕД.Добавить("59.11","Виробництво кіно- та відеофільмів, телевізійних програм"); 
	СписокКВЕД.Добавить("59.12","Компонування кіно- та відеофільмів, телевізійних програм"); 
	СписокКВЕД.Добавить("59.13","Розповсюдження кіно- та відеофільмів, телевізійних програм"); 
	СписокКВЕД.Добавить("59.14","Демонстрація кінофільмів"); 
	СписокКВЕД.Добавить("59.2","Видання звукозаписів"); 
	СписокКВЕД.Добавить("60.1","Діяльність у сфері радіомовлення"); 
	СписокКВЕД.Добавить("60.2","Діяльність у сфері телевізійного мовлення"); 
	СписокКВЕД.Добавить("61.1","Діяльність у сфері проводового електрозв'язку"); 
	СписокКВЕД.Добавить("61.2","Діяльність у сфері безпроводового електрозв'язку"); 
	СписокКВЕД.Добавить("61.3","Діяльність у сфері супутникового електрозв'язку"); 
	СписокКВЕД.Добавить("61.9","Інша діяльність у сфері електрозв'язку"); 
	СписокКВЕД.Добавить("62.01","Комп'ютерне програмування"); 
	СписокКВЕД.Добавить("62.02","Консультування з питань інформатизації"); 
	СписокКВЕД.Добавить("62.03","Діяльність із керування комп'ютерним устаткованням"); 
	СписокКВЕД.Добавить("62.09","Інша діяльність у сфері інформаційних технологій і комп'ютерних систем"); 
	СписокКВЕД.Добавить("63.11","Оброблення даних, розміщення інформації на веб-вузлах і пов'язана з ними діяльність"); 
	СписокКВЕД.Добавить("63.12","Веб-портали"); 
	СписокКВЕД.Добавить("63.91","Діяльність інформаційних агентств"); 
	СписокКВЕД.Добавить("63.99","Надання інших інформаційних послуг, н.в.і.у."); 
	СписокКВЕД.Добавить("68.1","Купівля та продаж власного нерухомого майна"); 
	СписокКВЕД.Добавить("68.2","Надання в оренду й експлуатацію власного чи орендованого нерухомого майна"); 
	СписокКВЕД.Добавить("68.31","Агентства нерухомості"); 
	СписокКВЕД.Добавить("68.32","Управління нерухомим майном за винагороду або на основі контракту"); 
	СписокКВЕД.Добавить("69.1","Діяльність у сфері права"); 
	СписокКВЕД.Добавить("69.2","Діяльність у сфері бухгалтерського обліку й аудиту; консультування з питань оподаткування"); 
	СписокКВЕД.Добавить("70.1","Діяльність головних управлінь (хед-офісів)"); 
	СписокКВЕД.Добавить("70.21","Діяльність у сфері зв'язків із громадськістю"); 
	СписокКВЕД.Добавить("70.22","Консультування з питань комерційної діяльності й керування"); 
	СписокКВЕД.Добавить("71.11","Діяльність у сфері архітектури"); 
	СписокКВЕД.Добавить("71.12","Діяльність у сфері інжинірингу, геології та геодезії, надання послуг технічного консультування в цих сферах"); 
	СписокКВЕД.Добавить("71.2","Технічні випробування та дослідження"); 
	СписокКВЕД.Добавить("72.11","Дослідження й експериментальні розробки у сфері біотехнологій"); 
	СписокКВЕД.Добавить("72.19","Дослідження й експериментальні розробки у сфері інших природничих і технічних наук"); 
	СписокКВЕД.Добавить("72.2","Дослідження й експериментальні розробки у сфері суспільних і гуманітарних наук"); 
	СписокКВЕД.Добавить("73.11","Рекламні агентства"); 
	СписокКВЕД.Добавить("73.12","Посередництво в розміщенні реклами в засобах масової інформації"); 
	СписокКВЕД.Добавить("73.2","Дослідження кон'юнктури ринку та виявлення громадської думки"); 
	СписокКВЕД.Добавить("74.1","Спеціалізована діяльність із дизайну"); 
	СписокКВЕД.Добавить("74.2","Діяльність у сфері фотографії"); 
	СписокКВЕД.Добавить("74.3","Надання послуг перекладу"); 
	СписокКВЕД.Добавить("74.9","Інша професійна, наукова та технічна діяльність, н.в.і.у."); 
	СписокКВЕД.Добавить("75.0","Ветеринарна діяльність"); 
	СписокКВЕД.Добавить("77.11","Надання в оренду автомобілів і легкових автотранспортних засобів"); 
	СписокКВЕД.Добавить("77.12","Надання в оренду вантажних автомобілів"); 
	СписокКВЕД.Добавить("77.21","Прокат товарів для спорту та відпочинку"); 
	СписокКВЕД.Добавить("77.22","Прокат відеозаписів і дисків"); 
	СписокКВЕД.Добавить("77.29","Прокат інших побутових виробів і предметів особистого вжитку"); 
	СписокКВЕД.Добавить("77.31","Надання в оренду сільськогосподарських машин і устатковання"); 
	СписокКВЕД.Добавить("77.32","Надання в оренду будівельних машин і устатковання"); 
	СписокКВЕД.Добавить("77.33","Надання в оренду офісних машин і устатковання, у тому числі комп'ютерів"); 
	СписокКВЕД.Добавить("77.34","Надання в оренду водних транспортних засобів"); 
	СписокКВЕД.Добавить("77.35","Надання в оренду повітряних транспортних засобів"); 
	СписокКВЕД.Добавить("77.39","Надання в оренду інших машин, устатковання та товарів, н.в.і.у."); 
	СписокКВЕД.Добавить("77.4","Лізинг інтелектуальної власності та подібних продуктів, крім творів, захищених авторськими правами"); 
	СписокКВЕД.Добавить("78.1","Діяльність агентств працевлаштування"); 
	СписокКВЕД.Добавить("78.2","Діяльність агентств тимчасового працевлаштування"); 
	СписокКВЕД.Добавить("78.3","Інша діяльність із забезпечення трудовими ресурсами"); 
	СписокКВЕД.Добавить("79.11","Діяльність туристичних агентств"); 
	СписокКВЕД.Добавить("79.12","Діяльність туристичних операторів"); 
	СписокКВЕД.Добавить("79.9","Надання інших послуг бронювання та пов'язана з цим діяльність"); 
	СписокКВЕД.Добавить("80.1","Діяльність приватних охоронних служб"); 
	СписокКВЕД.Добавить("80.2","Обслуговування систем безпеки"); 
	СписокКВЕД.Добавить("80.3","Проведення розслідувань"); 
	СписокКВЕД.Добавить("81.1","Комплексне обслуговування об'єктів"); 
	СписокКВЕД.Добавить("81.21","Загальне прибирання будинків"); 
	СписокКВЕД.Добавить("81.22","Інша діяльність із прибирання будинків і промислових об'єктів"); 
	СписокКВЕД.Добавить("81.29","Інші види діяльності із прибирання"); 
	СписокКВЕД.Добавить("81.3","Надання ландшафтних послуг"); 
	СписокКВЕД.Добавить("82.11","Надання комбінованих офісних адміністративних послуг"); 
	СписокКВЕД.Добавить("82.19","Фотокопіювання, підготування документів та інша спеціалізована допоміжна офісна діяльність"); 
	СписокКВЕД.Добавить("82.2","Діяльність телефонних центрів"); 
	СписокКВЕД.Добавить("82.3","Організування конгресів і торговельних виставок"); 
	СписокКВЕД.Добавить("82.91","Діяльність агентств зі стягування платежів і бюро кредитних історій"); 
	СписокКВЕД.Добавить("82.92","Пакування"); 
	СписокКВЕД.Добавить("82.99","Надання інших допоміжних комерційних послуг, н.в.і.у."); 
    Возврат СписокКВЕД;
	
	Возврат СписокКВЕД;
	
КонецФункции //ПолучитьСписокКВЕД()

&НаСервере
Функция ПолучитьНаименованиеВЕД(КВЕД)
	
	ЭлементКВЕД = КлассификаторКВЕД.НайтиПоЗначению(КВЕД);
	Если ЭлементКВЕД = Неопределено Тогда
		Возврат "";
	Иначе
		Возврат ЭлементКВЕД.Представление;
	КонецЕсли;
КонецФункции //ПолучитьНаименованиеВЕД()

&НаКлиенте
Процедура ТаблицаКВЕДПриИзменении(Элемент) 
	ТекущиеДанные = Элементы.Таблица.ТекущиеДанные;
	ТекущиеДанные.Флаг = КВЕДВключаетсяВОтчет(ТекущиеДанные.КВЕД);
	ТекущиеДанные.ВЕД = ПолучитьНаименованиеВЕД(ТекущиеДанные.КВЕД); 

	Если ФлагНЕЗаполнятьКВЕДДЛяПохожих Тогда
		Возврат;
	КонецЕсли;
	
	Для каждого СтрокаТаблицы Из Таблица Цикл
	
		Если ЗначениеЗаполнено(ТекущиеДанные.Субконто3) И ЗначениеЗаполнено(СтрокаТаблицы.Субконто3) 
			И СтрокаТаблицы.Субконто3 = ТекущиеДанные.Субконто3 Тогда
			СтрокаТаблицы.КВЕД = ТекущиеДанные.КВЕД; 
			СтрокаТаблицы.ВЕД = ТекущиеДанные.ВЕД; 
			СтрокаТаблицы.Флаг = ТекущиеДанные.Флаг; 
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(ТекущиеДанные.Субконто3) И НЕ ЗначениеЗаполнено(СтрокаТаблицы.Субконто3) 
			И ЗначениеЗаполнено(ТекущиеДанные.Субконто2) И ЗначениеЗаполнено(СтрокаТаблицы.Субконто2) 
			И СтрокаТаблицы.Субконто2 = ТекущиеДанные.Субконто2 Тогда
			
			СтрокаТаблицы.КВЕД = ТекущиеДанные.КВЕД; 
			СтрокаТаблицы.ВЕД = ТекущиеДанные.ВЕД; 
			СтрокаТаблицы.Флаг = ТекущиеДанные.Флаг; 
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(ТекущиеДанные.Субконто3) И НЕ ЗначениеЗаполнено(СтрокаТаблицы.Субконто3) 
			И НЕ ЗначениеЗаполнено(ТекущиеДанные.Субконто2) И НЕ ЗначениеЗаполнено(СтрокаТаблицы.Субконто2) 
			И СтрокаТаблицы.Субконто1 = ТекущиеДанные.Субконто1 Тогда
			
			СтрокаТаблицы.КВЕД = ТекущиеДанные.КВЕД; 
			СтрокаТаблицы.ВЕД = ТекущиеДанные.ВЕД; 
			СтрокаТаблицы.Флаг = ТекущиеДанные.Флаг; 
		КонецЕсли;
	
	КонецЦикла;
КонецПроцедуры
